# 增
# add方法：向集合中新增元素
s1 = {10, 20, 30, 40, 50}
s1.add(60)
print(s1)

# update方法：向集合中新增元素（必須傳遞可迭代物件，例如：列表、元組、集合等）
s1 = {10, 20, 30, 40, 50}
s1.update([60, 70])
s1.update((80, 90))
s1.update({100, 200})
s1.update(range(300, 308))
print(s1)

# 刪
# remove方法：從集合中移除元素（移除不存在的元素，會報錯）
s1 = {10, 20, 30, 40, 50}
s1.remove(20)
print(s1)

# discard方法：從集合中移除元素（移除不存在的元素，不會報錯）
s1 = {10, 20, 30, 40, 50}
s1.discard(80)
print(s1)

# pop方法：從集合中移除一個任意元素，傳回值是移除的那個元素
s1 = {10, 20, 30, 40, 50}
s2 = {'你好', '北京', '尚矽谷', 'hello'}
result = s1.pop()
print(s1)
print(result)

# clear方法：清空集合
s1 = {10, 20, 30, 40, 50}
s1.clear()
print(s1)

# 改
# 使用 add + remove 的組合，來實現修改的效果
s1 = {10, 20, 30, 40, 50}
s1.remove(20)
s1.add(66)
print(s1)

# 查：集合不能透過下標去讀取元素，但能透過 【成員運算符】去查看集合中是否包含指定元素
# 由於成員運算符適用於所有資料容器，所以我們會等所有資料容器都講完以後，再說成員運算符
s1 = {10, 20, 30, 40, 50}
# s1[0] # 此行報錯，因為集合不能透過下標存取元素
# 先提前感受一下成員運算符
result = 20 not in s1
print(result)