import pprint
from colorama import Fore, init

init(autoreset=True)


# 定義有內容的字典
d1 = {"張三": 72, "李四": 60, "王五": 85}
print(type(d1), d1)

# 字典中的key不能重複，若出現重複，則後寫的會覆蓋之前寫的
d1 = {"張三": 72, "李四": 60, "王五": 85, "張三": 99}
print(d1)

# 定義空字典
d1 = {}
d2 = dict()
print(type(d1), d1)
print(type(d2), d2)

# 字典中的key必須是不可變類型，但value可以是任意類型
# 通俗理解：只有不可變的東西，才能作為key
d1 = {250: 72, "李四": 60, "王五": 85}
d2 = {("抽菸", "喝酒"): 72, "李四": 60, "王五": 85}
print(d1)
print(d2)
# 錯誤範例：將列表作為key，是不行的
# d2 = {['抽菸', '喝酒']: 72, '李四': 60, '王五': 85}

# 字典可以巢狀
student_dict = {
    2025001: {"姓名": "張三", "年齡": 18, "成績": 72, "愛好": ["抽菸", "喝酒", "燙頭"]},
    2025002: {
        "姓名": "李四",
        "年齡": 19,
        "成績": 60,
        "愛好": ["唱歌", "跳舞", "打撞球"],
    },
    2025003: {
        "姓名": "王五",
        "年齡": 20,
        "成績": 85,
        "愛好": ["學習", "看書", "打太極"],
    },
}
print(student_dict)
